# BeamSystemTagParamRight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BeamSystemTagParamRight Property
ParameterTypeId Class See Also
---
"Right"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BeamSystemTagParamRight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamSystemTagParamRight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BeamSystemTagParamRight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace